Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes
The StraightDimensionAttributes class contains the attributes of the straight dimension.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.MiddleLowerTag
The dimension tag placed under the dimension value.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.DimensionValuePrefix
The prefix for the dimension's value.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.DimensionValuePostfix
The postfix for the dimension's value.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.LeftUpperTag
The left upper dimension tag.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.LeftMiddleTag
The left middle dimension tag.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.RightUpperTag
The right upper dimension tag.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.RightMiddleTag
The right middle dimension tag.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.LeftLowerTag
The left lower dimension tag.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.RightLowerTag
The right lower dimension tag.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.Exaggeration
The exaggeration attributes of the dimension.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.LoadAttributes(System.String)
The attributes can't be loaded.
AttributeFile: The filename of the attribute file.
Returns: False.

Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.